const sets = new Map<string, string>(
  Object.entries({
    Digits: '1234567890',
    'Special Characters': '!@#$%^&*()-_=+[]{}|;:\'",.<>?/`~',
    // eslint-disable-next-line perfectionist/sort-objects
    Arabic: 'ابتثجحخدذرزسشصضطظعغفقكلمنهوي',
    Armenian: 'ԱԲԳԴԵԶԷԸԹԺԻԼԽԾԿՀՁՂՃՄՅՆՇՈՉՊՋՌՍՎՏՐՑՈՒՓՔՕՖ',
    Bengali: 'অআইঈউঊঋএঐওঔকখগঘঙচছজঝঞটঠডঢণতথদধনপফবভমযরলশষসহ',
    Burmese: 'ကခဂဃငစဆဇဈဉညဋဌဍဎဏတထဒဓနပဖဗဘမယရလဝသဟဠအ',
    Chinese: '中文学校爱人国天地火水月金木生长心书电',
    Devanagari: 'अआइईउऊऋएऐओऔकखगघङचछजझञटठडढणतथदधनपफबभमयरलवशषसह',
    Ethiopic: 'አበግደከአበግደከ',
    Georgian: 'აბგდევზთიკლმნოპჟრსტუფქღყშჩცძწჭხჯჰ',
    Greek: 'ΑΒΓΔΕΖΗΘΚΛΜΝΞΠΡΣΤΥΦΧΨΩαβγδεζηθκλμνξπρστυφχψω',
    Hebrew: 'אבגדהוזחטיךכלמנסעפצקרשת',
    Hiragana:
      'あいうえおかきくけこさしすせそたちつてとなにぬねのはひふへほまみむめもやゆよらりるれろわをん',
    Katakana:
      'アイウエオカキクケコサシスセソタチツテトナニヌネノハヒフヘホマミムメモヤユヨラリルレロワヲン',
    Khmer: 'កខគឃងចឆជញដឋឌឍណតថទធនបផពភមយរលវសហឡអ',
    Latin: 'ABDEFGHJLMNPRSTUVWXYZabdefghjkmnprstuvwxyz',
    Other: 'אअあアกကአა',
    Russian: 'АБВГДЕЖЗИКЛМНПРСТУФХЦЧШЩЫЭЮЯабвгдежзиклмнпрстуфхцчшщыэюя',
    Tamil: 'அஆஇஈஉஊஎஏஐஒஓகஙசஞடணதநபமயரலவழளறன',
    Thai: 'กขคฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ',
    Ukrainian:
      'АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯабвгґдеєжзиіїйклмнопрстуфхцчшщьюя',
  }),
);

export default sets;
